import InstructionModal, {
  ModalButton,
} from "@/components/InstructionModals/InstructionModal";
import {
  Text,
  Flex,
  Box,
  HStack,
  UnorderedList,
  ListItem,
  OrderedList,
  Table,
  Thead,
  Tbody,
  Tr,
  Th as ChakraTh,
  Td as ChakraTd,
  TableContainer,
} from "@chakra-ui/react";
import React from "react";
import openPage from "@/utils/openPage";

function ELink({
  children,
  href,
}: {
  readonly children: React.ReactNode;
  readonly href: string;
}) {
  return (
    <a href={href} target="_blank" rel="noreferrer">
      <Text
        sx={{
          color: "primary.500",
          textDecoration: "underline",
          display: "inline",
          mx: 1,
        }}
      >
        {children}
      </Text>
    </a>
  );
}

const Th: React.FC<{ readonly children: React.ReactNode }> = ({ children }) => {
  return (
    <ChakraTh
      sx={{
        border: "1px solid #1A181C",
        textAlign: "center",
        lineHeight: 1.4,
        color: "#2d2d2d",
        fontWeight: 400,
        fontSize: "14px",
      }}
    >
      {children}
    </ChakraTh>
  );
};

const Td: React.FC<{ readonly children: React.ReactNode }> = ({ children }) => {
  return (
    <ChakraTd
      sx={{
        border: "1px solid #1A181C",
        textAlign: "center",
        lineHeight: 1.4,
        color: "#2d2d2d",
        fontWeight: 400,
        fontSize: "14px",
      }}
    >
      {children}
    </ChakraTd>
  );
};

export function CourseSelectionRulesModal() {
  return (
    <InstructionModal title="選課限制條件說明">
      <Flex flexDirection={"column"}>
        <Text>
          「選課限制條件」只在初選階段有身份限制，不會沿用至於開學後之加退選。
        </Text>
        <Box h="18px" />
        <Box>
          但下列二種情形需特別注意：
          <HStack ml="4px" align={"start"}>
            <Flex>1.</Flex>
            <Flex>
              在第一與第三類加簽中，若較高學制課程未開放較低學制學生修習者，系統將直接設定無法加選(由低到高學制分別為學士班、碩士班、博士班)；而第二類加簽是由教師發放授權碼，所以不受此限。
            </Flex>
          </HStack>
          <HStack ml="4px" align={"start"}>
            <Flex>2.</Flex>
            <Flex>在職專班課程限在職專班學生修習。</Flex>
          </HStack>
        </Box>
      </Flex>
    </InstructionModal>
  );
}

export function GeneralCommonCoursePrecautionModal() {
  return (
    <InstructionModal title="通識通修課程注意事項">
      <Flex flexDirection={"column"} gap="6">
        <Text>
          一、 凡 105 學年度已在學或新入學之學士班學生，應修習通識課程 15
          學分。轉學生、降級轉系學生，應依轉入年級學生之入學學年度為標準。入學之當年度第一學期即辦理休學者，應依其復學學年度為標準。
        </Text>
        <Text>
          二、 通識課程分為「文學與藝術 (A1)」、「歷史思維(A2)」、「世界文明
          (A3)」、「哲學與道德思考 (A4)」、「公民意識與社會分 析
          (A5)」、「量化分析與數學素養 (A6)」、「物質科學 (A7)」、「生命科學
          (A8)」等八大核心領域。學生應依據共同教育中心公佈之 「
          <ELink href="https://nol.ntu.edu.tw/nol/note/111-1/comarea.pdf">
            各院系指定學生應修習通識課程領域一覽表.pdf
          </ELink>
          」 ，修習其就讀學系指定領域之通識課程。滿足 3
          個指定領域，其餘不受指定領域限制。
        </Text>
        <Text>
          {" "}
          三、
          通識課程如兼跨二個領域者，得選擇計入其中任一領域。國際學生不受前項指定領域之限制。
        </Text>
        <Text>
          四、 大一國文可與通識課程A1~A4 等 4 個領域中任一領域相互充抵，至多 3
          學分。106
          學年度起，「大一國文」調整為「大學國文」，分為「大學國文一」與「大學國文二」，各自獨立，學生應至少修習
          1 門大學國文；修習 2 門大學國文可充抵通識課程 A1~A4 等 4
          個領域中任一領域，至多 3
          學分。僑生、國際學生應依本校「僑生、國際學生大學國文輔導辦法」修習。
          學生在大學國文與通識之修習方案有二： (一) 6 學分大學國文+12 學分通識
          (2 個指定領域)； (二) 3 學分大學國文+15 學分通識 (3 個指定領域)。
        </Text>
        <Text>
          五、 經共同教育中心核准並公布之專業基礎科目，可採計為通識學分，詳見「
          <ELink href="https://nol.ntu.edu.tw/nol/note/111-1/casge.pdf">
            採計為通識學分之專業基礎科目.pdf
          </ELink>
          」，或至共同教育中心網頁
          <ELink href="https://cge.ntu.edu.tw/cp_n_56967.html">
            https://cge.ntu.edu.tw/cp_n_56967.html
          </ELink>{" "}
          查看。
        </Text>{" "}
        <Text> 六、 修習基本能力課程可充抵通識學分，至多 6 學分。</Text>
        <Text>
          {" "}
          七、
          經認可為兼充通識課程或基本能力課程之一般課程，或可採計為通識學分之專業基礎科目，若為該學生畢業學系之必修課程，或為其畢業學系所開授之課程，不得採計為通識學分。
        </Text>
        <Text>
          八、
          超修或不可採計之通識課程或基本能力課程，採計為一般選修。惟若學生畢業之學系有其他規定，從其規定。
        </Text>
      </Flex>
    </InstructionModal>
  );
}

export function ChineseCoursePrecautionModal() {
  return (
    <InstructionModal title="大學國文選課及修習注意事項">
      <Flex flexDirection={"column"} gap="24px">
        <Text>第一學期：</Text>
        <Text>
          一、「大學國文」分為「大學國文：文學鑑賞與寫作(一)/
          (二)」、「大學國文：文化思想與寫作(一)/
          (二)」及「大學國文：閱讀與寫作(一)/
          (二)」，本校學生至少須修習其中一門，以滿足必修國文3學分之基本要求。
        </Text>
        <Text>
          二、若修習6學分大學國文課程，可充抵通識課程「文學與藝術」、「歷史思維」、「世界文明」、「哲學與道德思考」等四個領域中任一領域，至多3學分。
        </Text>
        <Text>三、本地生「大學國文」系列課程大一至大四任何學期皆可修習。</Text>
        <Text>
          四、本課程如有符合以下情況擬加選者可於第三週週四前洽中文系辦公室處理。
          <OrderedList ml={6} my={5}>
            <ListItem>
              <Flex>班級選課人數未達修課人數上限，擬加選者。</Flex>
            </ListItem>
            <ListItem>
              修畢第二學期「大學國文」，擬加選第一學期「大學國文」者。（需填寫「學生報告書」經授課教師同意）
            </ListItem>
            <ListItem>
              其他特殊狀況。（需填寫「學生報告書」敘明原因經授課教師同意）
            </ListItem>
          </OrderedList>
          以上第2、3兩類每班總共以5名為限。
        </Text>
        <Text>
          五、僑生、國際學生依據本校「僑生、國際學生大學國文輔導辦法」，應參加本校「僑生/國際學生華語文能力檢測」，並依檢測結果修課。
        </Text>
        <Text>
          六、有關國文領域課程最新消息請參閱大學國文網站
          <ELink href="https://cc.cl.ntu.edu.tw/">
            https://cc.cl.ntu.edu.tw/
          </ELink>{" "}
          公告。
        </Text>
        <Text>
          七、符合「國立臺灣大學學士班大學國文免修施行要點」申請條件之本校學生，得依本校公告之「基礎課程免修認證考試」相關規定申請考試。核准免修大學國文者，等同免修共同必修之國文領域課程，給予3學分並計入畢業學分數內；若再修習大學國文課程，所修課程學分與通識學分之充抵，依本校「通識課程與基本能力課程實施辦法」規定辦理。
        </Text>
        <Text>
          八、本地生之轉學生或重考生抵免國文領域後尚不足3學分者，可直接修習「大學國文」系列課程；亦可補修中文系專業科目，請參考下方一覽表。
          <Text
            mt={6}
            sx={{
              textIndent: "1em",
            }}
          >
            僑生、國際學生之轉學生抵免國文領域後，尚不足6學分者，依大一僑生、大一國際學生修習國文方式修課（參考注意事項五及六，視不足學分數修習），亦可補修中文系專業科目，請參考下方一覽表。
          </Text>
        </Text>
        <Flex gap={6}>
          <Text>聯絡人：張怡茵助教</Text> <Text>電話：02-33664005</Text>{" "}
          <Text>E-mail：yiyin747@ntu.edu.tw</Text>
        </Flex>
        <Text>
          轉學生或重考生抵免國文領域後尚不足學分者，若擬於111學年度第1學期補修，可自下列科目擇一修習：
          <UnorderedList my={5} ml={6}>
            <ListItem>佛典導讀（半年 / 3 學分 / 羅鈴沛）</ListItem>{" "}
            <ListItem>神話與文學（半年 / 3 學分 / 李文鈺） </ListItem>
            <ListItem>世紀末文學與文化 （半年 / 3 學分 / 潘少瑜）</ListItem>
            <ListItem>近現代報刊導論（半年 / 2 學分 / 蔡祝青） </ListItem>
            <ListItem>鮑照賦（半年 / 3 學分 / 李錫鎮） </ListItem>
            <ListItem>清代女性詩詞（半年 / 2 學分 / 卓清芬）</ListItem>
          </UnorderedList>
          ※由任課教師決定是否同意加選。
        </Text>
      </Flex>
    </InstructionModal>
  );
}

export function ForeignLanguageCoursePrecautionModal() {
  const tableOneData = [
    ["英文(附一小時英聽)一/二", "300 元"],
    ["英文(附二小時英聽)一/二", "600 元"],
    ["英文(含聽講實習)一/二", "600 元"],
  ];
  const tableTwoData = [
    ["107 22511", "日文一上", "3", "上"],
    ["107 22512", "日文一下", "3", "下"],
    ["107 32521", "日文二上", "3", "上"],
    ["107 32522", "日文二下", "3", "下"],
    ["107 42531", "日文三上", "3", "上"],
    ["107 42532", "日文三下", "3", "下"],
    ["004 30311 (107 50011)", "韓文一上", "3", "上"],
    ["004 30312 (107 50012)", "韓文一下", "3", "下"],
    ["004 30321 (107 50111)", "韓文二上", "3", "上"],
    ["004 30322 (107 50112)", "韓文二下", "3", "下"],
    ["004 30611 (107 50021)", "越南文一上", "3", "上"],
    ["004 30612 (107 50022)", "越南文一下", "3", "下"],
    ["004 30621 (107 50121)", "越南文二上", "3", "上"],
    ["004 30622 (107 50122)", "越南文二下", "3", "下"],
    ["004 30511 (107 50031)", "泰文一上", "3", "上"],
    ["004 30512 (107 50032)", "泰文一下", "3", "下"],
    ["004 30521 (107 50131)", "泰文二上", "3", "上"],
    ["004 30522 (107 50132)", "泰文二下", "3", "下"],
    ["004 30411 (107 50051)", "馬來文一上", "3", "上"],
    ["004 30412 (107 50052)", "馬來文一下", "3", "下"],
    ["(107 50151)", "馬來文二上", "3", "上"],
    ["(107 50152)", "馬來文二下", "3", "下"],
    ["004 30111 (107 50041)", "菲律賓文一上", "3", "上"],
    ["004 30112 (107 50042)", "菲律賓文一下", "3", "下"],
    ["004 30211 (107 50061)", "印尼文一上", "3", "上"],
    ["004 30212 (107 50062)", "印尼文一下", "3", "下"],
    ["004 30221 (107 50161)", "印尼文二上", "3", "上"],
    ["004 30222 (107 50162)", "印尼文二下", "3", "下"],
    ["004 30331", "韓文三上", "3", "上"],
    ["004 30332", "韓文三下", "3", "下"],
    ["004 30531", "泰文三上", "3", "上"],
    ["004 30532", "泰文三下", "3", "下"],
    ["102 22111", "法文一上", "3", "上"],
    ["102 22112", "法文一下", "3", "下"],
    ["102 22211", "德文一上", "3", "上"],
    ["102 22212", "德文一下", "3", "下"],
    ["102 22311", "西班牙文一上", "3", "上"],
    ["102 22312", "西班牙文一下", "3", "下"],
    ["102 22411", "俄文一上", "3", "上"],
    ["102 22412", "俄文一下", "3", "下"],
    ["102 22611", "拉丁文一上", "3", "上"],
    ["102 22612", "拉丁文一下", "3", "下"],
    ["102 22811", "古希臘文一上", "3", "上"],
    ["102 22812", "古希臘文一下", "3", "下"],
    ["102 22821", "義大利文一上", "3", "上"],
    ["102 22822", "義大利文一下", "3", "下"],
    ["102 22831", "葡萄牙文一上", "3", "上"],
    ["102 22832", "葡萄牙文一下", "3", "下"],
    ["102 22910", "初級荷蘭文", "3", "上"],
    ["102 22920", "初級荷蘭文二", "3", "下"],
    ["102 22910", "初級荷蘭文", "3", "上"],
    ["102 22920", "初級荷蘭文二", "3", "下"],
    ["102 22841", "荷蘭文一上", "3", "上"],
    ["102 22842", "荷蘭文一下", "3", "下"],
    ["102 22851", "土耳其文一上", "3", "上"],
    ["102 22852", "土耳其文一下", "3", "下"],
    ["102 22711", "阿拉伯文一上", "3", "上"],
    ["102 22712", "阿拉伯文一下", "3", "下"],
    ["102 22861", "波蘭文一上", "3", "上"],
    ["102 22862", "波蘭文一下", "3", "下"],
    ["102 22881", "捷克文一上", "3", "上"],
    ["102 22882", "捷克文一下", "3", "下"],
    ["102 32121", "法文二上", "3", "上"],
    ["102 32122", "法文二下", "3", "下"],
    ["102 32221", "德文二上", "3", "上"],
    ["102 32222", "德文二下", "3", "下"],
    ["102 32321", "西班牙文二上", "3", "上"],
    ["102 32322", "西班牙文二下", "3", "下"],
    ["102 32421", "俄文二上", "3", "上"],
    ["102 32422", "俄文二下", "3", "下"],
    ["102 32621", "拉丁文二上", "3", "上"],
    ["102 32622", "拉丁文二下", "3", "下"],
    ["102 32821", "古希臘文二上", "3", "上"],
    ["102 32822", "古希臘文二下", "3", "下"],
    ["102 32831", "義大利文二上", "3", "上"],
    ["102 32832", "義大利文二下", "3", "下"],
    ["102 32841", "葡萄牙文二上", "3", "上"],
    ["102 32842", "葡萄牙文二下", "3", "下"],
    ["102 32851", "荷蘭文二上", "3", "上"],
    ["102 32852", "荷蘭文二下", "3", "下"],
    ["102 32861", "土耳其文二上", "3", "上"],
    ["102 32862", "土耳其文二下", "3", "下"],
    ["102 22721", "阿拉伯文二上", "3", "上"],
    ["102 22722", "阿拉伯文二下", "3", "下"],
    ["102 32871", "波蘭文二上", "3", "上"],
    ["102 32872", "波蘭文二下", "3", "下"],
    ["102 32891", "捷克文二上", "3", "上"],
    ["102 32892", "捷克文二下", "3", "下"],
    ["102 54131", "進階法文上", "3", "上"],
    ["102 54132", "進階法文下", "3", "下"],
    ["102 54231", "進階德文上", "3", "上"],
    ["102 54232", "進階德文下", "3", "下"],
    ["102 54331", "進階西班牙文上", "3", "上"],
    ["102 54332", "進階西班牙文下", "3", "下"],
    ["102 54331", "進階西班牙文上", "3", "上"],
    ["102 54332", "進階西班牙文下", "3", "下"],
    ["102 54441", "進階俄文上", "3", "上"],
    ["102 54442", "進階俄文下", "3", "下"],
    ["102 42131", "法文三上", "3", "上"],
    ["102 42132", "法文三下", "3", "下"],
    ["102 42231", "德文三上", "3", "上"],
    ["102 42232", "德文三下", "3", "下"],
    ["102 42231", "西班牙文三上", "3", "上"],
    ["102 42232", "西班牙文三下", "3", "下"],
    ["102 42431", "俄文三上", "3", "上"],
    ["102 42432", "俄文三下", "3", "下"],
    ["102 42451", "葡萄牙文三上", "3", "上"],
    ["102 42452", "葡萄牙文三下", "3", "下"],
    ["102 42461", "波蘭文三上", "3", "上"],
    ["102 42462", "波蘭文三下", "3", "下"],
    ["102 42471", "義大利文三上", "3", "上"],
    ["102 42472", "義大利文三下", "3", "下"],
    ["102 42481", "荷蘭文三上", "3", "上"],
    ["102 42482", "荷蘭文三下", "3", "下"],
    ["102 42491", "捷克文三上", "3", "上"],
    ["102 42492", "捷克文三下", "3", "下"],
  ];
  return (
    <InstructionModal title="外文領域選課注意事項">
      <Flex flexDirection={"column"} gap="24px">
        <Text>111.8.19 更新 </Text>
        <Text>◎ 大一英文 </Text>
        <Text>
          一、自 106
          學年度起，停止辦理「新生入學英語聽力測驗」。學生不需參加測驗，大一英文不會被擋修，可直接選課。本制度不限大一新生，適用所有在學學生。（僑生、國際生仍須參加「僑生、國際學生入學華語文及英語能力檢測」，並依照測驗結果修讀國文與英文。）
        </Text>

        <Text>
          二、請依就讀學系之規定，擇一修習英文領域或外文領域，上下學期必須修習同一語言。若就讀學系規定「外文領域限定修習英文」，請務必修習上下學期英文領域課程。查詢網站：各系所必修課程查詢
          <ELink href="http://140.112.161.31/NTUVoxCourse/index.php/uquery/index">
            http://140.112.161.31/NTUVoxCourse/index.php/uquery/index
          </ELink>
          。
        </Text>
        <Text>三、英文領域課程加選</Text>
        <UnorderedList ml={6} my={2} spacing={4}>
          <ListItem>
            第一學期：初選第一階段：不開放大二以上學生上網選課(電機系大二除外)。初選第二階段：開放所有學生上網選課(不限年級、時段)。開學後加退選期間：所有學生可自行找授課教師加選(不限年級、時段)，經教師同意後請向教師領取授權碼。
          </ListItem>
          <ListItem>
            第二學期：初選第一階段直接帶入同學於第一學期所修習之科目班次；初選期間不開放上網選課，需要轉班或補修下學期課程者，請於加退選期間自行找授課教師加選。
          </ListItem>
        </UnorderedList>
        <Box>
          四、修習下列課程，且使用外語教學暨資源中心教室者，須向外語教學暨資源中心繳交語言實習費：
          <TableContainer my={6} ml={6} w="520px">
            <Table variant={"unstyled"}>
              <Thead>
                <Tr bg="#F6F6F6">
                  <Th>科目名稱</Th>
                  <Th>每學期費用</Th>
                </Tr>
              </Thead>
              <Tbody>
                {tableOneData.map((row) => (
                  <Tr>
                    {row.map((cell) => (
                      <Td>{cell}</Td>
                    ))}
                  </Tr>
                ))}
              </Tbody>
            </Table>
          </TableContainer>
        </Box>
        <Text>
          五、請依教務處公告之時程辦理加退選、查詢分發結果，並於開學第四週上網確認選課結果。加退選期間若有選課疑問，請至外文系辦公室求助。
        </Text>
        <Text>
          六、轉系、轉學生申請抵免大一英(外)文，依國立臺灣大學學生抵免學分辦法第五條第三點規定：如擬以學分少者抵免學分多者，則應由就讀學系（所）或師資培育中心指定補修科目以補足所差學分，若所差學分無性質相近科目可補修者，不得辦理抵免。
        </Text>
        <Text>
          七、符合大一英文免修條件之大一新生，得申請免修。請依本校行事曆公告之「基礎課程免修申請」期程，至「基礎課程免修作業系統
          <ELink href="https://curri.aca.ntu.edu.tw/waive_base/waive_base.asp">
            https://curri.aca.ntu.edu.tw/waive_base/waive_base.asp
          </ELink>
          」線上提出申請（僑生、國際生請另依「僑生、國際生入學華語文及英文能力檢測通知」所定方式與期限向外文系提出申請）。核准免修大一英文者，等同免修共同必修之外文領域課程及進階英語課程，給予學分並計入畢業學分數內。
        </Text>
        <Text>
          八、依據本校「一般生大一英文輔導要點」，部分學生將直接帶入指定之英文班次。欲修習就讀學系認可之其他外文領域課程者，則得退選之。
        </Text>
        <Text color="error.main">
          九、僑生和國際生入學時須參加英語能力檢測，因疫情影響，本次「英文能力測驗」全面線上進行，考量身份驗證問題，測驗結果僅供編班使用，無法免修大一英文。「英文能力測驗」結果顯示英文程度待加強者須修讀僑生、國際學生英文輔導班；其餘到考者，由外文系依所屬學院或學系進行大一英文課程編班。有關僑生和國際生英語能力檢測，請參閱「僑生、國際生入學華語文及英文能力檢測通知」。
        </Text>
        <Text>
          更多詳情請至外文系網站查詢{" "}
          <ELink href="https://www.forex.ntu.edu.tw/">
            https://www.forex.ntu.edu.tw/
          </ELink>
        </Text>
        <Text>◎ 日文及其它外文</Text>
        <Text>
          一、外文領域為全年課程，上學期成績不及格者，不得修習下學期課程。上下學期可選擇不同班次，但必須為同一語言（例如：日文一上＋日文一下；或法文二上＋法文二下）。
        </Text>
        <Box>
          二、97學年度起，學生亦可修習下列由外文系、日文系或外語教學暨資源中心開設之外語課程6學分作為外文領域學分，但上下學期必須為同一語言。
          <TableContainer my={6} ml={6}>
            <Table variant={"unstyled"}>
              <Thead>
                <Tr bg="#F6F6F6">
                  <Th>課程識別碼</Th>
                  <Th>課程名稱</Th>
                  <Th>學分數</Th>
                  <Th>開課學期</Th>
                </Tr>
              </Thead>
              <Tbody>
                {tableTwoData.map((row) => (
                  <Tr>
                    {row.map((data) => (
                      <Td>{data}</Td>
                    ))}
                  </Tr>
                ))}
              </Tbody>
            </Table>
          </TableContainer>
        </Box>
      </Flex>
    </InstructionModal>
  );
}

export function PECoursePrecautionModal() {
  return (
    <InstructionModal title="體育選課注意事項">
      <Flex flexDirection={"column"} gap={"24px"}>
        <Text>111.08.03</Text>
        <Text>
          本校體育課為電腦選課，請同學務必依自己的條件並配合下列說明選課：
        </Text>
        <Text>
          一、本校學士班一、二年級體育課為必修課程，課程規劃為「健康體適能」課程
          1 學分與「專項運動學群」課程 3 學分。學士班學生必須修完兩大學群共 4
          學分後方可畢業(體育學分不計入學系應修畢業學分)。
        </Text>
        <Text>
          二、「健康體適能」僅於每年上學期開課，會預先帶入大一新生必修課程中，學生若因個人特殊因素無法隨班上課而退選，且欲選擇其他時段健康體適能課程，則請先取得該時段授課教師同意後始至體育室領取授權碼。
          <OrderedList ml={6} mt={6} spacing={2}>
            <ListItem>大一健康體適能“不開放”初選，退選後即無法加選。</ListItem>
            <ListItem>
              大一上學期健康體適能退選後，也不能選修專項運動學群課程。
            </ListItem>
          </OrderedList>
        </Text>
        <Text>
          三、「專項運動學群」課程採興趣選項分組上課，得自大一下學期起開始修習。(專項運動課程同課名同課號之運動項目可重複選修)
          。
        </Text>
        <Text>
          四、體育選修課程限下列學生選修：
          <Box ml={2} mt={4} gap={2}>
            <Flex>
              (一)已修滿必修課程之學士班學生。(尚未修習完體育必修4學分之學士班學生如欲選「選修體育」，請於開學第三週辦理人工加簽。)
            </Flex>
            <Flex>(二) 碩、博士班研究生。</Flex>
          </Box>
        </Text>
        <Text>
          五、已修滿必修課程之學士班學生及碩、博士班研究生如欲修習「健康體適能」或「專項運動學群」等必修課程當選修學分，請於開學第三週辦理人工加簽。
        </Text>
        <Text>
          六、選修課程不能抵必修學分，「健康體適能」課程 1
          學分與「專項運動學群」課程 3 學分亦不得互抵。
        </Text>
        <Text>
          七、體育課程每學期以修習二門課程為限，且以修習必修學分者為優先。初選階段限分發上最多一門體育，如需加選第二門，應於開學後之加退選期間始得以授權碼。
        </Text>
        <Text>
          八、同學期如選修兩門專項運動學群課程中「同課號、不同班次」之運動項目，其中一門請於第
          3 週下載教師同意加簽單給老師加簽。
        </Text>
        <Text>
          九、校隊體育學分可優先抵免專項運動學群學分，俟專項運動學群 3
          學分抵滿後，始得抵免健康體適能 1 學分。
        </Text>
        <Text>十、凡在體育館內上課者，請自備乾淨球鞋。</Text>
        <Text>
          十一、其餘體育課程相關規定，請參閱{" "}
          <ELink href="https://sec.ntu.edu.tw/001/Upload/18/relfile/9783/25300/08b8dc92-49cf-4514-9b02-a14cabf5ad8d.pdf">
            本校學生體育課程修課辦法.pdf
          </ELink>{" "}
        </Text>
        <Text>
          十二、臺大體育室網址：
          <ELink href="https://pe.ntu.edu.tw">https://pe.ntu.edu.tw</ELink>
          <Flex>體育室教學組聯絡電話：(02)3366-9513</Flex>
        </Text>
      </Flex>
    </InstructionModal>
  );
}

export function ArmyCoursePrecautionLink() {
  return (
    <ModalButton
      title="國防教育選課注意事項"
      isExternal
      onClick={() => {
        openPage(
          "https://ssc.ntu.edu.tw/nationaldefenseeducation1/Courseinformation#anchorPageTitle"
        );
      }}
    />
  );
}

export function ProgramApplicationInfoLink() {
  return (
    <ModalButton
      title="各學程申請詳細資訊"
      isExternal
      onClick={() => {
        openPage("https://ifsel3.aca.ntu.edu.tw/cou_stu/index.php");
      }}
    />
  );
}

export function NTUSystemCourseUpdateScheduleModal() {
  return (
    <InstructionModal title="臺大系統課程更新日程">
      <Flex flexDirection={"column"} gap={6}>
        <Text>111 學年第 1 學期臺大系統課程更新日程</Text>
        <Text>
          為配合臺大系統(臺灣大學、臺灣科技大學、臺灣師範大學)學校選課時間，三校課程預定更新時間如下，請學生依所屬學校規定辦理相關事宜。
        </Text>
        <Box>
          <Flex>111/08/16(二)</Flex> <Flex>111/09/02 (五) </Flex>
          <Flex>111/09/06 (二) </Flex>
          <Flex>111/09/08 (四) </Flex>
          <Flex>111/09/13 (二)</Flex> <Flex>111/09/15 (四)</Flex>
          <Flex>111/09/19 (一)</Flex>
        </Box>
        <Text>
          臺大收到校際選課開放名額後，需要一些轉檔時間，感謝同學的耐心配合 🥺
        </Text>
      </Flex>
    </InstructionModal>
  );
}
