const college_map = {
    "0":{
        name: "未知學院"
    },
    "1":{
        name: "文學院"
    },
    "2":{
        name: "理學院"
    },
    "3":{
        name: "社會科學院"
    },
    "4":{
        name: "醫學院"
    },
    "5":{
        name: "工學院"
    },
    "6":{
        name: "生物資源暨農學院"
    },
    "7":{
        name: "管理學院"
    },
    "8":{
        name: "公共衛生學院"
    },
    "9":{
        name: "電機資訊學院"
    },
    "A":{
        name: "法律學院"
    },
    "B":{
        name: "生命科學院"
    },
    "H":{
        name: "學位學程"
    },
    "J":{
        name: "產業研發碩士專班"
    },
    "K":{
        name: "三校聯盟"
    },
    "Z":{
        name: "創新設計學院"
    }
};

export {college_map};